{
  "name": "Mohamed Fat-hy",
  "title": "Software Engineer",
  "subtitle": "Polyglot Developer • Flutter & Cross-Stack Engineer",
  "summary": "Software Engineer with over 5 years of experience building scalable, high-performance applications. I am a versatile, multi-stack developer with a strong foundation in Flutter, now delivering robust backend solutions using Spring Boot, .NET, and JavaScript (Cloud Functions). I focus on technical adaptability, Clean Architecture, and AI-integrated systems. Open to relocation.",
  "about": [
    "I started my professional journey in Civil Engineering, which built my foundation in analytical thinking and rapid problem-solving.",
    "Transitioning into software engineering taught me to be a 'polyglot' developer—focusing on architectural patterns that apply across any language or framework.",
    "I have 5+ years of experience delivering production apps used across multiple countries, specializing in bridging the gap between mobile frontends and complex backends.",
    "I thrive on technical variety: I architect mobile apps in Flutter, build enterprise backends in Spring Boot, and deploy serverless logic using JS Cloud Functions and Cloud Run.",
    "On the backend, I leverage Spring Boot for robust service layers, .NET for modern web APIs, and JavaScript for agile cloud-native deployments.",
    "I am currently focused on Generative AI integration, using Spring AI to build intelligent, data-driven features directly into the product core.",
    "I have served as a Tech Lead, managing feature delivery and cross-team communication between mobile, backend, and design teams.",
    "I use AI tools extensively to accelerate the engineering lifecycle—from research and prototyping to debugging and architectural design.",
    "I am highly adaptable, an ownership-driven teammate, and open to relocation for the right opportunity."
  ],
  "email": "mhmdfathy96@gmail.com",
  "github": "https://github.com/mhmdfathy96",
  "linkedin": "https://www.linkedin.com/in/mhmdfathy96/",
  "upwork": "https://www.upwork.com/freelancers/mofathy96",
  "cv": "https://drive.google.com/file/d/13Xn1x8biFuNnQnIPybM-kno_OMv7yUpV/view"
}
