{
  "name": "Mohamed Fathy",
  "title": "Software Engineer",
  "subtitle": "Mobile & Backend-Oriented • Flutter Specialist",
  "summary": "Software Engineer with over 4 years of experience building scalable, high-performance applications, primarily in Flutter for Android and iOS. Strong foundation in software engineering principles, Clean Architecture, and API-driven systems, with hands-on experience integrating backend services and working with C#/.NET and Java (Spring Boot). Comfortable across the full development lifecycle, highly adaptable to new technologies, and open to backend and cross-stack roles. Open to relocation.",
  "about": [
    "I started my professional journey with a background in Civil Engineering, which helped me develop strong analytical thinking and problem-solving skills.",
    "Over time, I transitioned into software engineering, driven by a genuine interest in building real systems that solve real problems.",
    "For more than 4 years, I’ve worked on production applications used by real users across multiple countries, focusing primarily on mobile development with Flutter while working closely with backend systems and real-time services.",
    "I’m comfortable owning features end-to-end — from planning and architecture to implementation, optimization, and delivery.",
    "Alongside mobile development, I have hands-on experience working with backend technologies across both **Java and C# ecosystems**.",
    "On the Java side, I work with **Spring Boot** for building RESTful APIs and backend services.",
    "On the Microsoft stack, I have experience with **C#**, **.NET Core**, **ASP.NET Web APIs**, and **Entity Framework**, including database integration and backend API development.",
    "I’m actively strengthening my backend and system design skills, aiming to grow into more backend-focused and full-stack engineering roles.",
    "I’ve also had opportunities to lead and coordinate with cross-functional teams, collaborating closely with backend engineers and UI/UX designers, which helped me grow beyond just writing code.",
    "Recently, I’ve been using AI tools extensively to accelerate research, debugging, and solution design — sometimes it honestly feels like having my own engineering team available 24/7."
  ],
  "email": "mhmdfathy96@gmail.com",
  "github": "https://github.com/mhmdfathy96",
  "linkedin": "https://www.linkedin.com/in/mhmdfathy96/",
  "upwork": "https://www.upwork.com/freelancers/mofathy96",
  "cv": "https://drive.google.com/file/d/13Xn1x8biFuNnQnIPybM-kno_OMv7yUpV/view"
}
